Schwabano/IMXRT1064-EVK-BuildEnvironment/PlatformPackage/LumA44/ewextgfx.c
    /* prepare access to the destination and source buffer */
    GfxLockSurface( aDstHandle, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, &dstMem );
    GfxLockSurface( aSrcHandle, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, &srcMem );

    /* select the necessary drawing function */
    worker = EwCopyNativeRow;

    /* let the Graphics Engine make the drawing operation */
    EwInitColorGradient( aWidth, aHeight, (unsigned int*)aColors, &gradient );
    EwEmulateCopy( &dstMem, &srcMem, aDstX, aDstY, aWidth, aHeight, aSrcX, aSrcY, &gradient, aWidth, aHeight, worker );

    /* unlock destination and source buffer */
    GfxUnlockSurface( aDstHandle, 0, 0, 0, 0, 0, 0, 0, 1, 0 );
    GfxUnlockSurface( aSrcHandle, 0, 0, 0, 0, 0, 0, 0, 0, 0 );
  }

  /* otherwise use the hardware... */
  else

#endif
  {
    uint32_t dstColorFormat = kPXP_OutputPixelFormatY8;
    uint32_t srcColorFormat = kPXP_PsPixelFormatY8;
    uint32_t color          = 0;

    /* prepare access to the destination and source buffer */
    GfxSelectSurfaces( aDstHandle, aSrcHandle );

    /* get the start address in the source and destination and their offsets */
    dst      = (void*)((unsigned char*)dstSurface->Pixel + (( aDstY * dstSurface->Width ) + aDstX ) * dstSurface->BytesPerPixel );
    dstPitch = dstSurface->Width * dstSurface->BytesPerPixel;
    src      = (void*)((unsigned char*)srcSurface->Pixel + (( aSrcY * srcSurface->Width ) + aSrcX ) * srcSurface->BytesPerPixel );
    srcPitch = srcSurface->Width * srcSurface->BytesPerPixel;

    /* choose the appropriate PXP drawing operation */
    EwBspGraphicsCopy( (uint32_t)dst, (uint32_t)src, dstPitch, srcPitch, aWidth, aHeight, dstColorFormat, srcColorFormat, color );
  }
}


/*******************************************************************************
* FUNCTION:
*   GfxUseGraphicsAccelerator
*
* DESCRIPTION:
*   The function GfxUseGraphicsAccelerator can be used to switch on/off the usage
*   of the graphics accelerator dynamically during runtime. If it is deactivated,
*   the software pixel driver of the Graphics Engine are used to execute the
*   different drawing operations.
*
* ARGUMENTS:
*   aActive     - Flag to control the usage of the graphics accelerator.
*
* RETURN VALUE:
*   None
*
*******************************************************************************/
void GfxUseGraphicsAccelerator( int aActive )
{
  /* check for any changes */
  if ( aActive == UseGraphicsAccelerator )
    return;

  #ifndef EW_DONT_USE_GFX_EMULATION

    /* just store the flag */
    UseGraphicsAccelerator = aActive;

    /* and put a message to the terminal */
    if ( aActive )
      EwPrint( "Graphics Accelerator is now active...\n" );
    else
      EwPrint( "Graphics Accelerator is now disabled!\n" );

  #else

    EwPrint( "Graphics Accelerator is always active.\n" );

  #endif
}


/*******************************************************************************
* FUNCTION:
*   GfxIsGraphicsAcceleratorUsed
*
* DESCRIPTION:
*   The function GfxIsGraphicsAcceleratorUsed returns a non zero value, if the
*   graphics accelerator hardware is activated.
*
* ARGUMENTS:
*   None
*
* RETURN VALUE:
*   A non zero value, if the graphics accelerator hardware is activated.
*
*******************************************************************************/
int GfxIsGraphicsAcceleratorUsed( void )
{
  return UseGraphicsAccelerator;
}

#endif /* EW_USE_GRAPHICS_ACCELERATOR */

/* msy */
